cocoasuny/nRF52832-Tcore/BootLoader/source/dfu_req_handling/dfu_req_handling.c
static void reset_device(void)
{
    NRF_LOG_INFO("Resetting device. \r\n");
#ifndef NRF_DFU_NO_TRANSPORT
    (void)nrf_dfu_transports_close();
#endif
    NVIC_SystemReset();
}


static void on_dfu_complete(fs_evt_t const * const evt, fs_ret_t result)
{
    m_dfu_finished_settings_write_state = DFU_FINISHED_SETTINGS_WRITE_STATE_COMPLETED;

    if (m_is_dfu_complete_response_sent)
    {
        reset_device();
    }
}


void nrf_dfu_req_handler_reset_if_dfu_complete(void)
{
    if (m_dfu_finished_settings_write_state == DFU_FINISHED_SETTINGS_WRITE_STATE_STARTED)
    {
        m_is_dfu_complete_response_sent = true;
    }

    if (m_dfu_finished_settings_write_state == DFU_FINISHED_SETTINGS_WRITE_STATE_COMPLETED)
    {
        reset_device();
    }
}


static void dfu_data_write_handler(fs_evt_t const * const evt, fs_ret_t result)
{
    --m_flash_operations_pending;
}


static void pb_decoding_callback(pb_istream_t *str, uint32_t tag, pb_wire_type_t wire_type, void *iter)
{
    pb_field_iter_t* p_iter = (pb_field_iter_t *) iter;

    // match the beginning of the init command
    if(p_iter->pos->ptr == &dfu_init_command_fields[0])
    {

        uint8_t *ptr = (uint8_t *) str->state;
        uint32_t size = str->bytes_left;

        // remove tag byte
        ptr++;
        size--;

        // store the info in init_packet_data
        init_packet_data.p_value = ptr;
        init_packet_data.length = size;

        NRF_LOG_INFO("PB: Init packet data len: %d\r\n", size);
    }
}


static nrf_dfu_res_code_t dfu_handle_prevalidate(dfu_signed_command_t const * p_command, pb_istream_t * p_stream, uint8_t * p_init_cmd, uint32_t init_cmd_len)
{
    dfu_init_command_t const *  p_init = &p_command->command.init;
    uint32_t                    err_code;
    uint32_t                    hw_version = NRF_DFU_HW_VERSION;
    uint32_t                    fw_version = 0;

    // check for init command found during decoding
    if(!p_init_cmd || !init_cmd_len)
    {
        return ext_error_set(NRF_DFU_EXT_ERROR_INIT_COMMAND_INVALID);
    }

#ifndef NRF_DFU_DEBUG_VERSION
    if(p_init->has_is_debug && p_init->is_debug == true)
    {
        // Prevalidation should fail if debug is set in an init package for a non-debug Secure DFU bootloader.
        return NRF_DFU_RES_CODE_OPERATION_FAILED;
    }
#endif

#ifdef NRF_DFU_DEBUG_VERSION
    if (p_init->has_is_debug == false || p_init->is_debug == false)
    {
#endif
        if (p_init->has_hw_version == false)
        {
			#ifdef BOOTLOADER_DFU_HANDING_DEBUG
				printf("No HW version\r\n");
			#endif
            return ext_error_set(NRF_DFU_EXT_ERROR_INIT_COMMAND_INVALID);
        }

        // Check of init command HW version
        if(p_init->hw_version != hw_version)
        {
			#ifdef BOOTLOADER_DFU_HANDING_DEBUG
				printf("Faulty HW version\r\n");
			#endif
            return ext_error_set(NRF_DFU_EXT_ERROR_HW_VERSION_FAILURE);
        }

#ifdef SOFTDEVICE_PRESENT
        // Precheck the SoftDevice version
        bool found_sd_ver = false;
        for(int i = 0; i < p_init->sd_req_count; i++)
        {
			printf("rx version:0x%x,local version:0x%x\r\n",p_init->sd_req[i],SD_FWID_GET(MBR_SIZE));
            if (p_init->sd_req[i] == SD_FWID_GET(MBR_SIZE))
            {
                found_sd_ver = true;
                break;
            }
        }
        if (!found_sd_ver)
        {
			#ifdef BOOTLOADER_DFU_HANDING_DEBUG
				printf("SD req not met\r\n");
			#endif
            return ext_error_set(NRF_DFU_EXT_ERROR_SD_VERSION_FAILURE);
        }
#endif

        // Get the fw version
        switch (p_init->type)
        {
            case DFU_FW_TYPE_APPLICATION:
                if (p_init->has_fw_version == false)
                {
                    return ext_error_set(NRF_DFU_EXT_ERROR_INIT_COMMAND_INVALID);
                }
                // Get the application FW version
                fw_version = s_dfu_settings.app_version;
                break;

            case DFU_FW_TYPE_SOFTDEVICE:
                // not loaded
                break;

            case DFU_FW_TYPE_BOOTLOADER: // fall through
            case DFU_FW_TYPE_SOFTDEVICE_BOOTLOADER:
                if (p_init->has_fw_version == false)
                {
                    return ext_error_set(NRF_DFU_EXT_ERROR_INIT_COMMAND_INVALID);
                }
                fw_version = s_dfu_settings.bootloader_version;
                break;

            default:
				#ifdef BOOTLOADER_DFU_HANDING_DEBUG
					printf("Unknown FW update type\r\n");
				#endif
                return ext_error_set(NRF_DFU_EXT_ERROR_INIT_COMMAND_INVALID);
        }
	
		#ifdef BOOTLOADER_DFU_HANDING_DEBUG
			printf("Req version: %d, Expected: %d\r\n", p_init->fw_version, fw_version);
		#endif

        // Check of init command FW version
        switch (p_init->type)
        {
            case DFU_FW_TYPE_APPLICATION:
                if (p_init->fw_version < fw_version)
                {
					#ifdef BOOTLOADER_DFU_HANDING_DEBUG
						printf("FW version too low\r\n");
					#endif
                    return ext_error_set(NRF_DFU_EXT_ERROR_FW_VERSION_FAILURE);
                }
                break;

            case DFU_FW_TYPE_BOOTLOADER:            // fall through
            case DFU_FW_TYPE_SOFTDEVICE_BOOTLOADER:
                // updating the bootloader is stricter. There must be an increase in version number
                if (p_init->fw_version <= fw_version)
                {
					#ifdef BOOTLOADER_DFU_HANDING_DEBUG
						printf("BL FW version too low\r\n");
					#endif
                    return ext_error_set(NRF_DFU_EXT_ERROR_FW_VERSION_FAILURE);
                }
                break;

            default:
                // do not care about fw_version in the case of a softdevice transfer
                break;
        }

#ifdef NRF_DFU_DEBUG_VERSION
    }
#endif

    // Check the signature
    switch (p_command->signature_type)
    {
        case DFU_SIGNATURE_TYPE_ECDSA_P256_SHA256:
            {
                #if 0
                NRF_LOG_INFO("Init command:\r\n");
                NRF_LOG_HEXDUMP_INFO(&s_dfu_settings.init_command[0], s_dfu_settings.progress.command_size);
                NRF_LOG_INFO("\r\n");

                NRF_LOG_INFO("Init command (raw data to be hashed):\r\n");
                NRF_LOG_HEXDUMP_INFO(&p_init_cmd[0], init_cmd_len);
                NRF_LOG_INFO("\r\n");
                #endif

