cocoasuny/nRF52832-Tcore/BootLoader/source/dfu_req_handling/dfu_req_handling.c
				#ifdef BOOTLOADER_DFU_HANDING_DEBUG
					printf("Calculating init packet hash\r\n");
				#endif
                err_code = nrf_crypto_hash_compute(hash_info_sha256, p_init_cmd, init_cmd_len, &init_packet_hash);
                if (err_code != NRF_SUCCESS)
                {
                    return NRF_DFU_RES_CODE_OPERATION_FAILED;
                }

                if (crypto_sig.length != p_command->signature.size)
                {
                    return NRF_DFU_RES_CODE_OPERATION_FAILED;
                }

                // Prepare the signature received over the air.
                memcpy(crypto_sig.p_value, p_command->signature.bytes, p_command->signature.size);

                #if 0
                NRF_LOG_INFO("Signature\r\n");
                NRF_LOG_HEXDUMP_INFO(&p_command->signature.bytes[0], p_command->signature.size);
                NRF_LOG_INFO("\r\n");
                #endif

                //NRF_LOG_INFO("signature len: %d\r\n", p_command->signature.size);

                // calculate the signature
				#ifdef BOOTLOADER_DFU_HANDING_DEBUG
					printf("Verify signature\r\n");
				#endif
                err_code = nrf_crypto_ecdsa_verify_hash(sig_info_p256, &crypto_key_pk, &init_packet_hash, &crypto_sig);
                if (err_code != NRF_SUCCESS)
                {
					#ifdef BOOTLOADER_DFU_HANDING_DEBUG
						printf("Signature failed\r\n");
					#endif
                    return NRF_DFU_RES_CODE_INVALID_OBJECT;
                }

				#ifdef BOOTLOADER_DFU_HANDING_DEBUG
					printf("Image verified\r\n");
				#endif
            }
            break;

        default:
			#ifdef BOOTLOADER_DFU_HANDING_DEBUG
				printf("Invalid signature type\r\n");
			#endif
            return ext_error_set(NRF_DFU_EXT_ERROR_WRONG_SIGNATURE_TYPE);
    }

    // Get the update size
    m_firmware_size_req = 0;

    switch (p_init->type)
    {
        case DFU_FW_TYPE_APPLICATION:
            if (p_init->has_app_size == false)
            {
				#ifdef BOOTLOADER_DFU_HANDING_DEBUG
					printf("No app image size\r\n");
				#endif
                return ext_error_set(NRF_DFU_EXT_ERROR_INIT_COMMAND_INVALID);
            }
            m_firmware_size_req += p_init->app_size;
            break;

        case DFU_FW_TYPE_BOOTLOADER:
            if (p_init->has_bl_size == false)
            {
				#ifdef BOOTLOADER_DFU_HANDING_DEBUG
					printf("No bl image size\r\n");
				#endif
                return ext_error_set(NRF_DFU_EXT_ERROR_INIT_COMMAND_INVALID);
            }
            m_firmware_size_req += p_init->bl_size;
            // check that the size of the bootloader is not larger than the present one.
#if defined ( NRF51 )
            if (p_init->bl_size > BOOTLOADER_SETTINGS_ADDRESS - BOOTLOADER_START_ADDR)
#elif defined( NRF52_SERIES )
            if (p_init->bl_size > NRF_MBR_PARAMS_PAGE_ADDRESS - BOOTLOADER_START_ADDR)
#endif
            {
				#ifdef BOOTLOADER_DFU_HANDING_DEBUG
					printf("BL too large\r\n");
				#endif
                return NRF_DFU_RES_CODE_INSUFFICIENT_RESOURCES;
            }
            break;

        case DFU_FW_TYPE_SOFTDEVICE:
            if (p_init->has_sd_size == false)
            {
				#ifdef BOOTLOADER_DFU_HANDING_DEBUG
					printf("No SD image size\r\n");
				#endif
                return ext_error_set(NRF_DFU_EXT_ERROR_INIT_COMMAND_INVALID);
            }
            m_firmware_size_req += p_init->sd_size;
            break;

        case DFU_FW_TYPE_SOFTDEVICE_BOOTLOADER:
            if (p_init->has_bl_size == false || p_init->has_sd_size == false)
            {
				#ifdef BOOTLOADER_DFU_HANDING_DEBUG
					printf("NO BL/SD size\r\n");
				#endif
                return ext_error_set(NRF_DFU_EXT_ERROR_INIT_COMMAND_INVALID);
            }
            m_firmware_size_req += p_init->sd_size + p_init->bl_size;
            if (p_init->sd_size == 0 || p_init->bl_size == 0)
            {
				#ifdef BOOTLOADER_DFU_HANDING_DEBUG
					printf("BL+SD size 0\r\n");
				#endif
                return NRF_DFU_RES_CODE_INVALID_PARAMETER;
            }

            // check that the size of the bootloader is not larger than the present one.
#if defined ( NRF51 )
            if (p_init->bl_size > BOOTLOADER_SETTINGS_ADDRESS - BOOTLOADER_START_ADDR)
#elif defined ( NRF52_SERIES )
            if (p_init->bl_size > NRF_MBR_PARAMS_PAGE_ADDRESS - BOOTLOADER_START_ADDR)
#endif
            {
				#ifdef BOOTLOADER_DFU_HANDING_DEBUG
					printf("BL too large (SD+BL)\r\n");
				#endif
                return NRF_DFU_RES_CODE_INSUFFICIENT_RESOURCES;
            }
            break;

        default:
			#ifdef BOOTLOADER_DFU_HANDING_DEBUG
				printf("Unknown FW update type\r\n");
			#endif
            return ext_error_set(NRF_DFU_EXT_ERROR_INIT_COMMAND_INVALID);
    }

	#ifdef BOOTLOADER_DFU_HANDING_DEBUG
		printf("Running hash check\r\n");
	#endif
    // SHA256 is the only supported hash
    memcpy(fw_hash.p_value, &p_init->hash.hash.bytes[0], NRF_CRYPTO_HASH_SIZE_SHA256);

    // Instead of checking each type with has-check, check the result of the size_req to
    // Validate its content.
    if (m_firmware_size_req == 0)
    {
		#ifdef BOOTLOADER_DFU_HANDING_DEBUG
			printf("No FW size\r\n");
		#endif
        return NRF_DFU_RES_CODE_INVALID_PARAMETER;
    }

    // Find the location to place the DFU updates
    err_code = nrf_dfu_find_cache(m_firmware_size_req, false, &m_firmware_start_addr);
    if (err_code != NRF_SUCCESS)
    {
		#ifdef BOOTLOADER_DFU_HANDING_DEBUG
			printf("Can't find room for update\r\n");
		#endif
        return NRF_DFU_RES_CODE_INSUFFICIENT_RESOURCES;
    }

	#ifdef BOOTLOADER_DFU_HANDING_DEBUG
		printf("Write address set to 0x%08x\r\n", m_firmware_start_addr);

		printf("DFU prevalidate SUCCESSFUL!\r\n");
	#endif

    return NRF_DFU_RES_CODE_SUCCESS;
}


/** @brief Function for validating the received image after all objects have been received and executed.
 *
 * @param[in]   p_init Pointer to
 *
 * @retval NRF_DFU_RES_CODE_INVALID_OBJECT Object invalid, update rejected.
 */
static nrf_dfu_res_code_t nrf_dfu_postvalidate(dfu_init_command_t * p_init)
{
    uint32_t                   err_code;
    nrf_dfu_res_code_t         res_code = NRF_DFU_RES_CODE_SUCCESS;
    nrf_dfu_bank_t           * p_bank;
    uint32_t                   current_SD_major;
    uint32_t                   new_SD_major;

