cocoasuny/nRF52832-Tcore/BootLoader/source/dfu_req_handling/dfu_req_handling.c
    switch (p_init->hash.hash_type)
    {
        case DFU_HASH_TYPE_SHA256:
            err_code = nrf_crypto_hash_compute(hash_info_sha256, (uint8_t*)m_firmware_start_addr, m_firmware_size_req, &fw_hash);
            if (err_code != NRF_SUCCESS)
            {
                res_code = NRF_DFU_RES_CODE_OPERATION_FAILED;
            }

            if (memcmp(fw_hash.p_value, p_init->hash.hash.bytes, NRF_CRYPTO_HASH_SIZE_SHA256) != 0)
            {
                NRF_LOG_ERROR("Hash failure\r\n");

                res_code = ext_error_set(NRF_DFU_EXT_ERROR_VERIFICATION_FAILED);
            }
            break;

        default:
            res_code = ext_error_set(NRF_DFU_EXT_ERROR_WRONG_HASH_TYPE);
            break;
    }

    if (s_dfu_settings.bank_current == NRF_DFU_CURRENT_BANK_0)
    {
        NRF_LOG_INFO("Current bank is bank 0\r\n");
        p_bank = &s_dfu_settings.bank_0;
    }
    else if (s_dfu_settings.bank_current == NRF_DFU_CURRENT_BANK_1)
    {
        NRF_LOG_INFO("Current bank is bank 1\r\n");
        p_bank = &s_dfu_settings.bank_1;
    }
    else
    {
        NRF_LOG_ERROR("Internal error, invalid current bank\r\n");
        return NRF_DFU_RES_CODE_OPERATION_FAILED;
    }

    NRF_LOG_INFO("Running SD version check ============== \r\n");
    // Verify the API version of potential new SoftDevices to prevent incompatibility.
    switch (p_init->type)
    {
        case DFU_FW_TYPE_APPLICATION:
            break;
        case DFU_FW_TYPE_SOFTDEVICE:
            // A new SD API in a SD update is not valid.
            current_SD_major = SD_VERSION_GET(MBR_SIZE)/1000000;
            new_SD_major = SD_VERSION_GET(m_firmware_start_addr)/1000000;
            if (current_SD_major != new_SD_major)
            {
                NRF_LOG_INFO("Miss-matched SD major version numbers. Update invalid. Current: %d. New: %d.\r\n", current_SD_major, new_SD_major);
                res_code = NRF_DFU_RES_CODE_INVALID_OBJECT;
            }
            break;
        case DFU_FW_TYPE_BOOTLOADER:
            break;
        case DFU_FW_TYPE_SOFTDEVICE_BOOTLOADER:
            // A new SD API in a SD+BL update invalidates the existing application.
            current_SD_major = SD_VERSION_GET(MBR_SIZE)/1000000;
            new_SD_major = SD_VERSION_GET(m_firmware_start_addr)/1000000;
            if (current_SD_major != new_SD_major)
            {
                NRF_LOG_INFO("Miss-matched SD major version numbers. Current app will be invalidated. Current: %d. New: %d.\r\n", current_SD_major, new_SD_major);
                if (s_dfu_settings.bank_current == NRF_DFU_CURRENT_BANK_1)
                {
                    s_dfu_settings.bank_0.bank_code = NRF_DFU_BANK_INVALID;
                }
            }
            break;
        default:
            res_code = NRF_DFU_RES_CODE_OPERATION_FAILED;
            break;
    }

    // Finalize postvalidation by updating DFU settings.
    if (res_code == NRF_DFU_RES_CODE_SUCCESS)
    {
        NRF_LOG_INFO("Successfully ran the postvalidation check!\r\n");

        switch (p_init->type)
        {
            case DFU_FW_TYPE_APPLICATION:
                p_bank->bank_code = NRF_DFU_BANK_VALID_APP;
                // If this update is in bank 1, invalidate bank 0 before starting copy routine.
                if (s_dfu_settings.bank_current == NRF_DFU_CURRENT_BANK_1)
                {
                    NRF_LOG_INFO("Invalidating old application in bank 0.\r\n");
                    s_dfu_settings.bank_0.bank_code = NRF_DFU_BANK_INVALID;
                }
                break;
            case DFU_FW_TYPE_SOFTDEVICE:
                p_bank->bank_code = NRF_DFU_BANK_VALID_SD;
                s_dfu_settings.sd_size = p_init->sd_size;
                break;
            case DFU_FW_TYPE_BOOTLOADER:
                p_bank->bank_code = NRF_DFU_BANK_VALID_BL;
                break;
            case DFU_FW_TYPE_SOFTDEVICE_BOOTLOADER:
                p_bank->bank_code = NRF_DFU_BANK_VALID_SD_BL;
                s_dfu_settings.sd_size = p_init->sd_size;
                break;
            default:
                res_code = ext_error_set(NRF_DFU_EXT_ERROR_INIT_COMMAND_INVALID);
                break;
        }

#ifdef NRF_DFU_DEBUG_VERSION
        if (p_init->has_is_debug == false || p_init->is_debug == false)
        {
#endif

            switch (p_init->type)
            {
                case DFU_FW_TYPE_APPLICATION:
                    s_dfu_settings.app_version = p_init->fw_version;
                    break;
                case DFU_FW_TYPE_BOOTLOADER:
                case DFU_FW_TYPE_SOFTDEVICE_BOOTLOADER:
                    s_dfu_settings.bootloader_version = p_init->fw_version;
                    break;
                default:
                    // no implementation
                    break;
            }

#ifdef NRF_DFU_DEBUG_VERSION
        }
#endif
        // Calculate CRC32 for image
        p_bank->image_crc = s_dfu_settings.progress.firmware_image_crc;
        p_bank->image_size = m_firmware_size_req;
    }
    else
    {
        p_bank->bank_code = NRF_DFU_BANK_INVALID;

        // Calculate CRC32 for image
        p_bank->image_crc = 0;
        p_bank->image_size = 0;
    }

    // Set the progress to zero and remove the last command
    memset(&s_dfu_settings.progress, 0, sizeof(dfu_progress_t));
    memset(s_dfu_settings.init_command, 0xFF, DFU_SIGNED_COMMAND_SIZE);
    s_dfu_settings.write_offset = 0;

    // Store the settings to flash and reset after that
    m_dfu_finished_settings_write_state = DFU_FINISHED_SETTINGS_WRITE_STATE_STARTED;
    if( nrf_dfu_settings_write(on_dfu_complete) != NRF_SUCCESS)
    {
        res_code = NRF_DFU_RES_CODE_OPERATION_FAILED;
    }

    return res_code;
}


/** @brief Function to handle signed command
 *
 * @param[in]   p_command   Signed
 */
static nrf_dfu_res_code_t dfu_handle_signed_command(dfu_signed_command_t const * p_command, pb_istream_t * p_stream)
{
    nrf_dfu_res_code_t ret_val = NRF_DFU_RES_CODE_SUCCESS;

    // Currently only init-packet is signed
    if (p_command->command.has_init != true)
    {
        return NRF_DFU_RES_CODE_INVALID_OBJECT;
    }

    ret_val = dfu_handle_prevalidate(p_command, p_stream, init_packet_data.p_value, init_packet_data.length);
    if(ret_val == NRF_DFU_RES_CODE_SUCCESS)
    {
		#ifdef BOOTLOADER_DFU_HANDING_DEBUG
			printf("Prevalidate OK.\r\n");
		#endif

        // This saves the init command to flash
		#ifdef BOOTLOADER_DFU_HANDING_DEBUG
			printf("Saving init command...\r\n");
		#endif
        if (nrf_dfu_settings_write(NULL) != NRF_SUCCESS)
        {
            return NRF_DFU_RES_CODE_OPERATION_FAILED;
        }
    }
    else
    {
		#ifdef BOOTLOADER_DFU_HANDING_DEBUG
			printf("Prevalidate failed:0x%01x\r\n",ret_val);
		#endif
    }
    return ret_val;
}


